pruebas/results/2025-11-10_22-33-49/S2_1_proxy_ro_t8.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 583.78 qps: 9348.25 (r/w/o: 8179.88/0.00/1168.37) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 756.45 qps: 12103.55 (r/w/o: 10590.66/0.00/1512.89) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 823.00 qps: 13166.95 (r/w/o: 11520.94/0.00/1646.01) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            302974
        write:                           0
        other:                           43282
        total:                           346256
    transactions:                        21641  (721.08 per sec.)
    queries:                             346256 (11537.32 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0107s
    total number of events:              21641

Latency (ms):
         min:                                    5.19
         avg:                                   11.09
         max:                                   55.88
         95th percentile:                       16.12
         sum:                               239972.13

Threads fairness:
    events (avg/stddev):           2705.1250/165.91
    execution time (avg/stddev):   29.9965/0.00